{
  "כניסה לעסק": [
    "Is the entrance clearly marked?",
    "Is there a ramp for wheelchair access?",
    "Is the entrance wide enough for a wheelchair to pass through easily?",
    "Is the entrance free of any obstacles or steps?",
    "Summarize all your answers to the previous questions (Is the entrance clearly marked?, Is there a ramp for wheelchair access?, Is the entrance wide enough for a wheelchair to pass through easily?, Is the entrance free of any obstacles or steps?) and translate the summary to hebrew (show only the translation)"
  ],

  "דלת הכניסה": [
    "Are the doors automatic or easy to open?",
    "Are the doors wide enough for wheelchair access?",
    "Are the door handles easy to grasp and use?",
    "Do the doors have a clear glass panel for visibility?",
    "Summarize all your answers to the previous questions (Are the doors automatic or easy to open?, Are the doors wide enough for wheelchair access?, Are the door handles easy to grasp and use?, Do the doors have a clear glass panel for visibility?) and translate the summary to hebrew (show only the translation)"
  ],

  "מעברים": [
    "Are the aisles wide enough for a wheelchair to pass through comfortably?",
    "Are the aisles free of obstacles and clutter?",
    "Are the floor surfaces smooth and non-slip?",
    "Is there adequate lighting in the aisles?"
  ],
  "דלפקים": [
    "Are the counters at a height accessible for people in wheelchairs?",
    "Are there lowered sections of the counters for better accessibility?",
    "Is there enough space in front of the counters for wheelchair maneuvering?",
    "Are the payment terminals reachable from a seated position?"
  ],

  "שירותים": [
    "Are there accessible restrooms available?",
    "Is there enough space for wheelchair maneuvering inside the restrooms?",
    "Are the restroom fixtures (sink, toilet) at an accessible height?",
    "Are there grab bars installed in the restrooms?"
  ],

  "חנייה": [
    "Are there designated accessible parking spaces available?",
    "Are the accessible parking spaces close to the entrance?",
    "Are the parking spaces wide enough for wheelchair access?",
    "Is the path from the parking area to the entrance smooth and obstacle-free?"
  ],

  "מעליות": [
    "Are elevators available for access to different floors?",
    "Are the elevator buttons at an accessible height?",
    "Is there audible and visual indication of floors in the elevator?",
    "Is the elevator large enough to accommodate a wheelchair?"
  ],

  "מדפים": [
    "Are items on shelves reachable from a seated position?",
    "Are there step stools or assistance available for higher shelves?",
    "Are the labels on the shelves easy to read?",
    "Is there enough space between shelves for easy navigation?"
  ],

  "final_result": [
    "Generate a detailed accessibility report for user according to the following results: {}.\n\n",
    "In case you have recommendations to steps that need to be made in order to make the place more",
    "accessible, write them as well. Write the report in Hebrew. Each title should be written with ",
    "### at the beginning, and each sub-title should be written with - ** before the sub-title ",
    "and ** after the sub-title. In the recommendations part, write ### before the part's title, ",
    "and each recommendation should be in two lines - the first one for the recommendation's title, ",
    "with - ** before it and ** after it, and the second one should be the recommendation's description, ",
    "without any symbol."
  ],

  "comment": [
    "Your response regarding the accessibility of this place is the following: {}. ",
    "The text submitted by the customer is {}.",
    "You should be the deciding one regarding the accessibility of this given place. You can see the response you provided us ",
    "previously regarding this place's accessibility after you saw its images, and now there is a customer saying what he thinks about that, ",
    "when he also provided an image to strengthen the claims. You should answer what you think about that. ",
    "Note that the customer might be frustrated or have some bad will to harm the business owner, so you should judge this ",
    "claims very seriously and give a precise answer.",
    "Summarize your answer into 1-2 sentences and translate the summary to hebrew (show only the translation)."
  ]
}