{
    "כניסה לעסק": [
        "According to the photos attached, if the accessible entrance is not the main entrance, is there clear directional signage from the main entrance to the accessible entrance?",
        "According to the photos attached, is there a clear area (free of obstacles) in front of the entrance doors (both inside and outside) with dimensions of 170 cm X 130 cm or 150 cm X 150 cm?",
        "According to the photos attached, if the height difference at the entrance door is more than 1 cm, is there a solution to overcome the height difference such as a ramp with a recommended width of at least 75 cm?",
        "According to the photos attached, if there are stairs, is there also a standard ramp, lift, or elevator next to them?",
        "According to the photos attached, is the clear width for passage on the ramp at least 110 cm and the slope up to 10%? If the length of the ramp is up to 250 cm, can the slope be up to 12.5%? If it is not possible to install a ramp with these dimensions, is there a stable mobile ramp with a width of 90 cm and a slope of up to 12%?",
        "According to the photos attached, summarize all your answers to the previous questions (If the accessible entrance is not the main entrance, Is there clear directional signage from the main entrance to the accessible entrance?, Is there a clear area (free of obstacles) in front of the entrance doors (both inside and outside) with dimensions of 170 cm X 130 cm or 150 cm X 150 cm?, If the height difference at the entrance door is more than 1 cm, is there a solution to overcome the height difference such as a ramp with a recommended width of at least 75 cm?, If there are stairs, is there also a standard ramp, lift, or elevator next to them?, Is the clear width for passage on the ramp at least 110 cm and the slope up to 10%? If the length of the ramp is up to 250 cm, can the slope be up to 12.5%? If it is not possible to install a ramp with these dimensions, Is there a stable mobile ramp with a width of 90 cm and a slope of up to 12%?) and translate the summary to hebrew (show only the translation). The questions themselves shouldn't be written in your answer, only the summary in hebrew"
    ],
    "דלתות": [
        "According to the photos attached, are the doors automatic or easy to open? Or is there an intercom with an activation button located at a height of up to 140 cm from the floor?",
        "According to the photos attached, are the door handles of the lever type?",
        "According to the photos attached, is the door opening width at least 75 cm?",
        "According to the photos attached, for glass doors and partitions wider than 75 cm, are there markings such as stickers with a diameter of at least 15 cm in two contrasting colors? Are the markings placed at two heights: one at 90 cm and the other at 150 cm from the floor? (This does not apply if there is a horizontal component at a height of 90-160 cm or when the distance between vertical components is no greater than 60 cm.)",
        "According to the photos attached, summarize all your answers to the previous questions (Are the doors automatic or easy to open? Or is there an intercom with an activation button located at a height of up to 140 cm from the floor?, Are the door handles of the lever type?, Is the door opening width at least 75 cm?, For glass doors and partitions wider than 75 cm, are there markings such as stickers with a diameter of at least 15 cm in two contrasting colors? Are the markings placed at two heights: one at 90 cm and the other at 150 cm from the floor? (This does not apply if there is a horizontal component at a height of 90-160 cm or when the distance between vertical components is no greater than 60 cm.)) and translate the summary to hebrew (show only the translation). The questions themselves shouldn't be written in your answer, only the summary in hebrew"
    ],
    "ריצוף": [
        "According to the photos attached, is the floor made of hard material and free of protrusions and indentations?",
        "According to the photos attached, summarize all your answers to the previous questions (Is the floor made of hard material and free of protrusions and indentations?) and translate the summary to hebrew (show only the translation). The questions themselves shouldn't be written in your answer, only the summary in hebrew"
    ],
    "מעברים": [
        "According to the photos attached, are the aisles in the business and between fixed shelves and furniture at least 90 cm wide?",
        "According to the photos attached, are there no obstacles (such as plants, boxes, and chairs) on the way to the service counter?",
        "According to the photos attached, are all public passageways at least 80 cm wide?",
        "If there are stairs inside the business, is there also a standard ramp, lift, or elevator next to them?",
        "According to the photos attached, summarize all your answers to the previous questions (Are the aisles in the business and between fixed shelves and furniture at least 90 cm wide?, Are there no obstacles (such as plants, boxes, and chairs) on the way to the service counter?, Are all public passageways at least 80 cm wide?, If there are stairs inside the business, is there also a standard ramp, lift, or elevator next to them?) and translate the summary to hebrew (show only the translation). The questions themselves shouldn't be written in your answer, only the summary in hebrew"
    ],
    "דלפק שירות": [
        "According to the photos attached, is there a clear area in front of the service counter with dimensions of 170 cm X 130 cm or 150 cm X 150 cm?",
        "According to the photos attached, is at least one section of the service counter at least 90 cm wide and the surface height below 110 cm?",
        "According to the photos attached, for service counters where the customer sits: is the surface height between 73-80 cm? Is the width at least 90 cm? Is there a free knee space of at least 48 cm on the customer's side?",
        "According to the photos attached, is there a hearing aid system at the service counter, connected to electricity whenever the business is open, and have service providers been trained to operate it?",
        "According to the photos attached, summarize all your answers to the previous questions (Is there a clear area in front of the service counter with dimensions of 170 cm X 130 cm or 150 cm X 150 cm?, Is at least one section of the service counter at least 90 cm wide and the surface height below 110 cm?, For service counters where the customer sits: is the surface height between 73-80 cm? Is the width at least 90 cm? Is there a free knee space of at least 48 cm on the customer's side?, Is there a hearing aid system at the service counter, connected to electricity whenever the business is open, and have service providers been trained to operate it?) and translate the summary to hebrew (show only the translation). The questions themselves shouldn't be written in your answer, only the summary in hebrew"
    ],
    "שילוט": [
        "According to the photos attached, are the signs in the business written in simple and clear language, with large and clear letters in a contrasting color to the background? Are they compliant with the accessibility standard at the time of purchase?",
        "According to the photos attached, summarize all your answers to the previous questions (Are the signs in the business written in simple and clear language, with large and clear letters in a contrasting color to the background? Are they compliant with the accessibility standard at the time of purchase?) and translate the summary to hebrew (show only the translation)"
    ],
    "ישיבה": [
        "According to the photos attached, if there are chairs for public use, are at least 10% and no less than one chair stable, with armrests and a backrest with the specified dimensions?",
        "According to the photos attached, in a place providing catering services, are 5% of the tables and at least one table with free space for seating a person with a wheelchair and a surface height of 73-80 cm and a depth of at least 48 cm?",
        "According to the photos attached, summarize all your answers to the previous questions (If there are chairs for public use, are at least 10% and no less than one chair stable, with armrests and a backrest with the specified dimensions?, In a place providing catering services, are 5% of the tables and at least one table with free space for seating a person with a wheelchair and a surface height of 73-80 cm and a depth of at least 48 cm?) and translate the summary to hebrew (show only the translation). The questions themselves shouldn't be written in your answer, only the summary in hebrew"
    ],
    "מכונות מכירה ושירות": [
        "According to the photos attached, if vending machines, payment machines, or automatic service machines are installed, is there a free area of at least 170 cm X 130 cm or 150 cm X 150 cm in front of the machine? Are the operating components (buttons, payment, product delivery) located at a height of 38-140 cm?",
        "According to the photos attached, summarize all your answers to the previous questions (If vending machines, payment machines, or automatic service machines are installed, is there a free area of at least 170 cm X 130 cm or 150 cm X 150 cm in front of the machine? Are the operating components (buttons, payment, product delivery) located at a height of 38-140 cm?) and translate the summary to hebrew (show only the translation). The questions themselves shouldn't be written in your answer, only the summary in hebrew"
    ],
    "שירותים": [
        "According to the photos attached, if there is a public restroom inside the business, is a sink installed at a height of 80-85 cm with a lever-type faucet or automatic operation?",
        "According to the photos attached, are grab bars installed on both sides of the toilet and on the inner side of the door?",
        "According to the photos attached, are the internal dimensions of the restroom at least 150 cm X 200 cm?",
        "According to the photos attached, summarize all your answers to the previous questions (If there is a public restroom inside the business, is a sink installed at a height of 80-85 cm with a lever-type faucet or automatic operation?, Are grab bars installed on both sides of the toilet and on the inner side of the door?, Are the internal dimensions of the restroom at least 150 cm X 200 cm?) and translate the summary to hebrew (show only the translation). The questions themselves shouldn't be written in your answer, only the summary in hebrew"
    ],

    "final_result": [
    "Generate a detailed accessibility report for user according to the following results: {}.\n\n",
    "In case you have recommendations to steps that need to be made in order to make the place more",
    "accessible, write them as well. Write the report in Hebrew. Each title should be written with ",
    "### at the beginning, and each sub-title should be written with - ** before the sub-title ",
    "and ** after the sub-title. In the recommendations part, write ### before the part's title, ",
    "and each recommendation should be in two lines - the first one for the recommendation's title, ",
    "with - ** before it and ** after it, and the second one should be the recommendation's description, ",
    "without any symbol."
  ],

  "comment": [
    "Your response regarding the accessibility of this place is the following: {}. ",
    "The text submitted by the customer is {}.",
    "You should be the deciding one regarding the accessibility of this given place. You can see the response you provided us ",
    "previously regarding this place's accessibility after you saw its images, and now there is a customer saying what he thinks about that, ",
    "when he also provided an image to strengthen the claims. You should answer what you think about that. ",
    "Note that the customer might be frustrated or have some bad will to harm the business owner, so you should judge this ",
    "claims very seriously and give a precise answer.",
    "Summarize your answer into 1-2 sentences and translate the summary to hebrew (show only the translation)."
  ]
}
